# ImportIFCOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImportIFCOptions Members
ImportIFCOptions Class Methods Properties See Also
---
The ImportIFCOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ImportIFCOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetImportIFCOptions | Returns the current Revit instance's ImportIFCOptions. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LinkProcessor | Specifies the engine to use while doing a Link IFC operation. |

# See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace